Revit 2026 API

# IFCPropertyMappingInfoRevitPropertyName Property

---

The Revit property name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string RevitPropertyName { get; set; }
```
```vb
Public Property RevitPropertyName As String
	Get
	Set
```
```cpp
public:
property String^ RevitPropertyName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member RevitPropertyName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

IFCPropertyMappingInfo Class

Autodesk.Revit.DB Namespace